# Assignment 1

In [1]:
import pandas as pd

You are given the following int variable _x1_

In [2]:
x1 = 3286
x1

3286

__1__ - Complete the code below to transform _x1_ into a string *x1_str*. Extract the four digits and compute *x1_reverse* by taking the digits of _x1_ backward. *x1_reverse* should be an **integer** equal to 6823

In [3]:
x1_str = str(x1)
digit_1 = x1_str[0]
digit_2 = x1_str[1]
digit_3 = x1_str[2]
digit_4 = x1_str[3]

x1_reverse = int(x1_str[3] + x1_str[2] + x1_str[1] + x1_str[0])

print("first digit = %s, second = %s, third = %s, fourth = %s" % (digit_1, digit_2, digit_3, digit_4))
print("the reverse number of x1 =", x1_reverse)

first digit = 3, second = 2, third = 8, fourth = 6
the reverse number of x1 = 6823

__2__- Write a function that takes as input a number with any given length and returns its reversed one.     
For example: `reverse_number(274) = 472, reverse_number(15739) = 93751`.   
**Hint** You can use negative indexing. For example: `"ABCD"[-1] = D`

In [4]:
def reverse_number(x):
    x_str = str(x)
    return int(x_str[::-1])
    
print(reverse_number(274))
print(reverse_number(15739))

472
93751

A **palindromic** number or numeral palindrome is a number that remains the same when its digits are reversed, like 16461. See [wikipedia](https://en.wikipedia.org/wiki/Palindromic_number)      
**3**- Write a function that returns _True_ when a number is palindromic and _False_ when not

In [5]:
def is_palindromic(x):    
    temp=x
    rev=0
    while(x>0):
        dig=x%10
        rev=rev*10+dig
        x=x//10
    if(temp==rev):
        return True
    else:
        return False

is_palindromic(16461)

True

**4**- Create a dictionary containing two keys:
* number: numbers between 10 and 99
* palindromic ?: a Boolean whether or not the number is palindromic or not

It should look like this: `dic = {'number': [10,11,12 ...], 'palindromic ?':[False,True,False,....]}`

In [6]:
dic = {}
numbers = [i for i in range(10, 100)]
palindromic = [is_palindromic(i) for i in numbers]

dic['number'] = numbers
dic['palindromic'] = palindromic

**5**- Create a dataframe _df_ from _dic_ and print the head of _df_, its shape, and the data type of each column

In [7]:
df = pd.DataFrame.from_dict(dic)

# head of df
df.head(10)

   number  palindromic
0      10        False
1      11         True
2      12        False
3      13        False
4      14        False
5      15        False
6      16        False
7      17        False
8      18        False
9      19        False

In [8]:
# shape of df
df.shape

(90, 2)

In [9]:
# data type of each column
type(df['number']), type(df['palindromic'])

(pandas.core.series.Series, pandas.core.series.Series)

__6__- How many palindromic numbers are there in _df_.   
**Hint**: Booleans are considered as 0, 1. For example: `sum([True, False, True]) = 2`.   
Filter _df_ to print only rows with palindromic numbers.

In [10]:
sum(df['palindromic'])

9

A [nontrivial reverse number](https://en.wikipedia.org/wiki/Reverse_divisible_number) is a either 1/4 or 1/9 of its reversal.     
For example: 1089 Ã— 9 = 9801, the reversal of 1089.    
__7__- Write a function that checks whether a number is a nontrivial reverse number. The response for the following three tests should be `True`, `False`, `False`.     
Use your function to identify all the nontrivial reverse numbers that are below 100 000. **Hint**: there are four

In [13]:
def is_nontrivial_reverse_number(x):
    return x*4 == reverse_number(x) or x*9 == reverse_number(x) 

print(is_nontrivial_reverse_number(1089))
print(is_nontrivial_reverse_number(2000))
print(is_nontrivial_reverse_number(7887))

True
False
False

In [16]:
# nontrivial reverse numbers below 100 000
[print(i) for i in range(1,100000) if is_nontrivial_reverse_number(i)]
# your code here

1089
2178
10989
21978

[None, None, None, None]

**8**- Read the csv file _"titanic.csv"_ into a dataframe _titanic_. Print its shape and head

In [18]:
titanic = pd.read_csv('./titanic.csv')
print(titanic.shape)
titanic.head()

(891, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**9**- Print the names of titanic columns. Remove the column _"Cabin"_ and print again the names of titanic columns

In [19]:
# print column names
# your code here
print(titanic.columns)
# drop the column : "Cabin
# your code here
titanic.drop(columns='Cabin', inplace=True)
# make sur it is removed by printing again column names
# your code here
print(titanic.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked'],
      dtype='object')

**10**- Print the number of null values for each column. Replace null values in _"Age"_ by the average age, and null values in _"Embarked"_ by the most frequent value _"S"_. Print again the number of null values for each column

In [23]:
# print number of null values for each column
# your code here
print(titanic.count())

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Embarked       889
dtype: int64

In [27]:
# Replace null values
# your code here
titanic['Age'].fillna(titanic['Age'].mean(), inplace=True)
titanic['Embarked'].fillna('S', inplace=True)

In [28]:
# print again number of null values for each column
# your code here
print(titanic.count())

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            891
SibSp          891
Parch          891
Ticket         891
Fare           891
Embarked       891
dtype: int64